base/DataProcessors/ВыполнениеОпераций2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыполнениеОпераций2_2</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

base/InformationRegisters/НастройкиОткрытияФормПриНачалеРаботыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОткрытияФормПриНачалеРаботыСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстовоеПредставлениеПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОткрываемаяФорма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОткрываемыеПриНачалеРаботыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/DataProcessors/ВыполнениеОпераций2_2/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Команды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	Возврат;
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Возврат;
КонецПроцедуры

// Возвращает структуру параметров, заданных в настройках открытия формы.
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьНастройкиПользователя() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НастройкиОткрытияФормПриНачалеРаботыСистемы.Параметры КАК Параметры
		|ИЗ
		|	РегистрСведений.НастройкиОткрытияФормПриНачалеРаботыСистемы КАК НастройкиОткрытияФормПриНачалеРаботыСистемы
		|ГДЕ
		|	НастройкиОткрытияФормПриНачалеРаботыСистемы.Пользователь = &Пользователь
		|	И НастройкиОткрытияФормПриНачалеРаботыСистемы.ОткрываемаяФорма = &ОткрываемаяФорма");
	
	Запрос.УстановитьПараметр("ОткрываемаяФорма",
		Перечисления.ФормыОткрываемыеПриНачалеРаботыСистемы.РабочееМестоВыполнениеОпераций);
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ХранилищеПараметров = Результат.Параметры;// ХранилищеЗначения
		Возврат ХранилищеПараметров.Получить();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Прочее

//++ Локализация

// Подобрать исполнителя.
// 
// Параметры:
//  Ссылка - СправочникСсылка.ФизическиеЛица, СправочникСсылка.Сотрудники -
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники, СправочникСсылка.ФизическиеЛица - Подобрать исполнителя
Функция ПодобратьИсполнителя(Ссылка) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Исполнитель = Неопределено;
	
	ИспользуетсяУчетТрудозатратВРазрезеСотрудников = ПроизводствоСервер.ИспользуетсяУчетТрудозатратВРазрезеСотрудников(
		ТекущаяДата);
	
	Если ИспользуетсяУчетТрудозатратВРазрезеСотрудников И ТипЗнч(Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка), Истина, Неопределено, ТекущаяДата);
			
		Если ОсновныеСотрудники.Количество() > 0 Тогда
			Исполнитель = ОсновныеСотрудники[0].Сотрудник;
		КонецЕсли;
		
	ИначеЕсли НЕ ИспользуетсяУчетТрудозатратВРазрезеСотрудников И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Сотрудники") Тогда
		Исполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ФизическоеЛицо");
	КонецЕсли;
	
	Возврат Исполнитель;
	
КонецФункции

//-- Локализация

#КонецОбласти

#КонецОбласти

#КонецЕсли
